lisp/init-ref.org

* Ref 所使用的工具函数
#+begin_src emacs-lisp :tangle yes :results none
  ;; init-ref.el --- Initialize Ref's configurations.	-*- lexical-binding: t -*-
  ;; 本文件由 org 文件管理，请在对应的 org 文件中编辑，不要修改本文件
#+end_src

** org 相关工具
#+begin_src emacs-lisp :tangle yes :results none
(defun ref/org-timeS-less-p (x y)
  "比较两个org-mode时间格式的时间大小，其中x，y为string类型"
  (org-time-less-p (org-timestamp-to-time(org-timestamp-from-string x))
                   (org-timestamp-to-time (org-timestamp-from-string y)))
  )


(defun ref/create-org-file ()
  "Create an org file in org-directory"
  (interactive)
  (let ((name (read-string "Filename: ")))
    (expand-file-name (format "%s.org"
                              name) org-directory)))

#+end_src
** 编辑命令

#+BEGIN_SRC emacs-lisp :tangle yes :results none
(defun ref/newline-return ()
  "append (open) a new line below the current line, and execute return"
  (interactive)
  (move-end-of-line 1)
  (org-newline-and-indent))

(defun ref/newline-meta-return ()
  "append (open) a new line below the current line, org-meta-return"
  (interactive)
  (move-end-of-line 1)
  (org-meta-return))
#+END_SRC

** 配置工作流程

统计 knowledgebase 的下的字数
#+begin_src emacs-lisp :tangle yes
  (defun ref/reset-count ()
    (interactive)
    (shell-command  (expand-file-name (format "%s/scripts/update_record.sh" org-directory)))
    )
#+end_src

优化选中文字的描述，由 Claude-3 生成，提示词如下：
this is gptel-request，I hope to achieve such a function: When I select a region, I want the LLM to optimize this paragraph of text

#+BEGIN_SRC emacs-lisp :tangle yes :results none
  (require 'gptel)
  (defun ref/flow/optimize-region ()
    "Optimize the text in the currently marked region using the LLM."
    (interactive)
    (when (use-region-p)
      (let ((region-text (buffer-substring-no-properties (region-beginning) (region-end))))
        (gptel-request
         (format "优化代码块中的文字，要求：\n1. 要书面化一点\n2. 修正错别字\n3. 修正语句不通顺的地方\n\n```org\n%s\n```\n输出要求：\n1. 禁止修改原有格式\n2. 只返回代码块中优化后文字，不要用代码块包裹" region-text)
         :callback (lambda (response info)
                     (if response
                         (progn
                           (delete-region (region-beginning) (region-end))
                           (insert response)
                           (deactivate-mark)
                           (message "优化完成"))
                       (message "Optimization failed with message: %s"
                                (plist-get info :status)))))
        )))
#+END_SRC

** END: Package Requirements

#+BEGIN_SRC emacs-lisp :tangle yes :result none
(require 'init-org-ql)
(provide 'init-ref)
#+END_SRC
